# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
result_list = [2, 'some_text', 555, 66.3, None]
for elem in result_list:
    print(type(elem))
